## Plan output

```
module.application.module.service.data.aws_partition.current: Reading...
module.logging.module.s3.data.aws_caller_identity.current: Reading...
module.application.module.secrets.data.aws_partition.current: Reading...
module.application.module.database.data.aws_caller_identity.identity: Reading...
module.logging.data.aws_region.current: Reading...
module.application.module.secrets.data.aws_region.current: Reading...
module.logging.module.s3.data.aws_region.current: Reading...
module.logging.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.module.s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.service.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.data.aws_lambda_functions.all: Reading...
module.application.module.database.module.database.data.aws_partition.current: Reading...
module.application.module.service.data.aws_caller_identity.identity: Reading...
module.application.module.database.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.dashboard.data.aws_region.current: Reading...
module.application.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Reading...
module.application.module.dashboard.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Read complete after 0s [id=76086537]
module.application.module.database.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.bastion.data.aws_partition.current: Reading...
module.bastion.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.module.vpc.data.aws_region.current[0]: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.logging.module.s3.data.aws_caller_identity.current: Read complete after 1s [id=891377151751]
module.application.module.database.data.aws_rds_engine_version.this: Reading...
module.application.module.service.data.aws_caller_identity.identity: Read complete after 1s [id=891377151751]
module.logging.data.aws_lambda_functions.all: Read complete after 1s [id=us-east-1]
module.application.module.secrets.data.aws_caller_identity.identity: Reading...
module.application.module.secrets.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.bastion.data.aws_ami.bastion: Reading...
module.application.module.service.data.aws_route53_zone.domain["this"]: Reading...
module.logging.data.aws_caller_identity.identity: Reading...
module.logging.module.s3.data.aws_organizations_organization.current: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.logging.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.logging.module.s3.data.aws_partition.current: Reading...
module.logging.module.s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.dashboard.data.aws_partition.current: Reading...
module.application.module.dashboard.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.data.aws_lambda_functions.all: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=891377151751]
module.application.module.dashboard.data.aws_route53_zone.domain["this"]: Reading...
module.application.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.backend.data.aws_caller_identity.identity: Reading...
module.backend.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.bastion.data.aws_caller_identity.identity: Reading...
module.application.module.database.data.aws_rds_engine_version.this: Read complete after 0s [id=17.5]
module.application.module.service.data.aws_region.current: Reading...
module.application.module.service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_availability_zones.available: Reading...
module.bastion.data.aws_region.current: Reading...
module.bastion.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.bastion.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Reading...
module.application.module.service.data.aws_route53_zone.domain["this"]: Read complete after 0s [id=Z056235726NAHLFZ5UGDD]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Reading...
module.logging.module.s3.data.aws_organizations_organization.current: Read complete after 0s [id=o-f5mr0gq6lc]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Reading...
module.application.module.dashboard.data.aws_route53_zone.domain["this"]: Read complete after 0s [id=Z056235726NAHLFZ5UGDD]
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Reading...
module.bastion.data.aws_ami.bastion: Read complete after 0s [id=ami-08982f1c5bf93d976]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Read complete after 1s [id=3798321550]
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Read complete after 1s [id=874300523]
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Read complete after 1s [id=1314884315]
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Read complete after 1s [id=3701104373]
module.backend.data.aws_partition.current: Reading...
module.application.module.dashboard.data.aws_caller_identity.identity: Reading...
module.backend.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.worker.data.aws_partition.current: Reading...
module.application.module.worker.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.data.aws_partition.current: Reading...
module.application.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.module.vpc.data.aws_partition.current[0]: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.application.module.dashboard.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.data.aws_caller_identity.identity: Reading...
module.application.module.worker.data.aws_region.current: Reading...
module.application.module.worker.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Read complete after 1s [id=1808222790]
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Read complete after 1s [id=2644592029]
module.application.module.service.module.ecr["this"].data.aws_caller_identity.current: Reading...
module.application.module.database.data.aws_region.current: Reading...
module.application.module.service.module.alb["this"].data.aws_partition.current: Reading...
module.application.module.database.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.service.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.service.module.ecr["this"].data.aws_partition.current: Reading...
module.logging.data.aws_partition.current: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Read complete after 1s [id=1315226949]
module.application.module.dashboard.module.alb["this"].data.aws_partition.current: Reading...
module.logging.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.service.module.ecr["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.dashboard.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.database.data.aws_partition.current: Reading...
module.logging.data.aws_elb_service_account.current: Reading...
module.logging.data.aws_elb_service_account.current: Read complete after 0s [id=127311923021]
module.application.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.module.worker.data.aws_caller_identity.identity: Reading...
module.application.module.service.module.ecr["this"].data.aws_caller_identity.current: Read complete after 0s [id=891377151751]
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Read complete after 0s [id=3795168285]
module.application.module.worker.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.logging.data.aws_lambda_function.datadog["this"]: Reading...
module.application.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Reading...
module.application.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=475677258]
module.logging.module.s3.data.aws_iam_policy_document.default: Reading...
module.logging.module.s3.data.aws_iam_policy_document.default: Read complete after 0s [id=705826187]
module.application.data.aws_lambda_function.datadog["this"]: Reading...
module.logging.data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr]
module.application.data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr]
module.logging.module.s3.data.aws_iam_policy_document.combined: Reading...
module.logging.module.s3.data.aws_iam_policy_document.combined: Read complete after 0s [id=2124188810]
module.application.module.dashboard.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Reading...
module.application.module.service.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Reading...
module.application.module.worker.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Reading...
module.application.module.dashboard.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Read complete after 0s [id=/illinois-getchildcare/qa/version]
module.application.module.service.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Read complete after 0s [id=/illinois-getchildcare/qa/version]
module.application.module.worker.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Read complete after 0s [id=/illinois-getchildcare/qa/version]
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Reading...
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ec2"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ec2"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Read complete after 0s [id=us-east-1]
module.application.module.dashboard.data.aws_vpc.current: Reading...
module.application.module.service.data.aws_vpc.current: Reading...
module.application.module.worker.data.aws_vpc.current: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=90403638]
module.application.module.worker.data.aws_vpc.current: Read complete after 0s [id=vpc-0d4fbd78717d772f7]
module.application.module.dashboard.data.aws_vpc.current: Read complete after 0s [id=vpc-0d4fbd78717d772f7]
module.application.module.service.data.aws_vpc.current: Read complete after 0s [id=vpc-0d4fbd78717d772f7]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Read complete after 0s [id=3795168285]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Read complete after 0s [id=1808222790]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 1s [id=195798706]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 1s [id=1315226949]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Read complete after 1s [id=1314884315]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Read complete after 1s [id=3701104373]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Read complete after 1s [id=2644592029]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 1s [id=874300523]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 1s [id=2187510914]
module.application.module.dashboard.data.aws_secretsmanager_secret_version.oidc["this"]: Reading...
module.application.module.dashboard.data.aws_secretsmanager_secret_version.oidc["this"]: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/oidc-20250717174559817700000001-U8tPQA|AWSCURRENT]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

OpenTofu will perform the following actions:

  # module.application.module.dashboard.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-qa-dashboard/illinois-getchildcare-qa-dashboard"
        name                               = "illinois-getchildcare-qa-dashboard"
        tags                               = {
            "service" = "application-dashboard"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-qa-dashboard:180" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.application.module.service.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-qa-app/illinois-getchildcare-qa-app"
        name                               = "illinois-getchildcare-qa-app"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-qa-app:330" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.application.module.worker.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-qa-worker/illinois-getchildcare-qa-worker"
        name                               = "illinois-getchildcare-qa-worker"
        tags                               = {
            "service" = "application-worker"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-qa-worker:314" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.application.module.dashboard.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-qa-dashboard:180" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-qa-dashboard" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - mountPoints       = []
                    name              = "illinois-getchildcare-qa-dashboard"
                  ~ portMappings      = [
                      ~ {
                          - hostPort      = 8000
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  ~ secrets           = [
                      - {
                          - name      = "ACTIVE_CASELOAD_CODES"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:active_caseload_codes::"
                        },
                        {
                            name      = "ADDRESS_VALIDATION_ENABLED"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_address_validation::"
                        },
                        # (24 unchanged elements hidden)
                        {
                            name      = "ENABLE_MULTIPLE_PROVIDERS"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_multiple_providers::"
                        },
                      - {
                          - name      = "ENABLE_NEW_SDA_CASELOAD_CODES"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_new_sda_caseload_codes::"
                        },
                        {
                            name      = "ENABLE_RESOURCE_ORG_EMAIL"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_resource_org_email::"
                        },
                        # (5 unchanged elements hidden)
                        {
                            name      = "OCP_APIM_SUBSCRIPTION_KEY"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/ccms-20250325214954368200000010-QVK0R3:ocp_apim_key::"
                        },
                      - {
                          - name      = "PENDING_CASELOAD_CODES"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:pending_caseload_codes::"
                        },
                        {
                            name      = "RESOURCE_ORG_EMAILS"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:resource_org_emails::"
                        },
                        # (7 unchanged elements hidden)
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                    # (9 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "otel-collector"
                  - portMappings     = []
                  - systemControls   = []
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "illinois-getchildcare-qa-dashboard" -> (known after apply)
      ~ revision                 = 180 -> (known after apply)
        tags                     = {
            "service" = "application-dashboard"
        }
        # (11 unchanged attributes hidden)
    }

  # module.application.module.service.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-qa-app:330" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-qa-app" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - mountPoints       = []
                    name              = "illinois-getchildcare-qa-app"
                  ~ portMappings      = [
                      ~ {
                          - hostPort      = 8080
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  ~ secrets           = [
                      - {
                          - name      = "ACTIVE_CASELOAD_CODES"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:active_caseload_codes::"
                        },
                        {
                            name      = "ADDRESS_VALIDATION_ENABLED"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_address_validation::"
                        },
                        # (22 unchanged elements hidden)
                        {
                            name      = "ENABLE_MULTIPLE_PROVIDERS"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_multiple_providers::"
                        },
                      - {
                          - name      = "ENABLE_NEW_SDA_CASELOAD_CODES"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_new_sda_caseload_codes::"
                        },
                        {
                            name      = "ENABLE_RESOURCE_ORG_EMAIL"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_resource_org_email::"
                        },
                        # (5 unchanged elements hidden)
                        {
                            name      = "OCP_APIM_SUBSCRIPTION_KEY"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/ccms-20250325214954368200000010-QVK0R3:ocp_apim_key::"
                        },
                      - {
                          - name      = "PENDING_CASELOAD_CODES"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:pending_caseload_codes::"
                        },
                        {
                            name      = "RESOURCE_ORG_EMAILS"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:resource_org_emails::"
                        },
                        # (7 unchanged elements hidden)
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                    # (9 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "otel-collector"
                  - portMappings     = []
                  - systemControls   = []
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "illinois-getchildcare-qa-app" -> (known after apply)
      ~ revision                 = 330 -> (known after apply)
      - tags                     = {} -> null
        # (11 unchanged attributes hidden)
    }

  # module.application.module.worker.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-qa-worker:314" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-qa-worker" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - mountPoints       = []
                    name              = "illinois-getchildcare-qa-worker"
                  ~ portMappings      = [
                      ~ {
                          - hostPort      = 80
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  ~ secrets           = [
                      - {
                          - name      = "ACTIVE_CASELOAD_CODES"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:active_caseload_codes::"
                        },
                        {
                            name      = "ADDRESS_VALIDATION_ENABLED"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_address_validation::"
                        },
                        # (24 unchanged elements hidden)
                        {
                            name      = "ENABLE_MULTIPLE_PROVIDERS"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_multiple_providers::"
                        },
                      - {
                          - name      = "ENABLE_NEW_SDA_CASELOAD_CODES"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_new_sda_caseload_codes::"
                        },
                        {
                            name      = "ENABLE_RESOURCE_ORG_EMAIL"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_resource_org_email::"
                        },
                        # (5 unchanged elements hidden)
                        {
                            name      = "OCP_APIM_SUBSCRIPTION_KEY"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/ccms-20250325214954368200000010-QVK0R3:ocp_apim_key::"
                        },
                      - {
                          - name      = "PENDING_CASELOAD_CODES"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:pending_caseload_codes::"
                        },
                        {
                            name      = "RESOURCE_ORG_EMAILS"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:resource_org_emails::"
                        },
                        # (7 unchanged elements hidden)
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "otel-collector"
                  - portMappings     = []
                  - systemControls   = []
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "illinois-getchildcare-qa-worker" -> (known after apply)
      ~ revision                 = 314 -> (known after apply)
        tags                     = {
            "service" = "application-worker"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```